IDEA Open Model
CheckMember1D Class
 Check meber 1D
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.CheckMember
 IdeaRS.OpenModel.Model.CheckMember1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class CheckMember1D : CheckMember
Public Class CheckMember1D
	Inherits CheckMember
public ref class CheckMember1D : public CheckMember
The CheckMember1D type exposes the following members.
Constructors
Name | Description
CheckMember1D
 Constructor
Top
Properties
Name | Description
Id
 Element Id
 (Inherited from OpenElementId.)
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace